In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [4]:
df = pd.DataFrame(randn(5,3),index='A B C D E'.split(),columns='X Y Z'.split())

In [5]:
df

          X         Y         Z
A  0.832021  0.108961 -0.007013
B  0.231534 -1.417395  0.149589
C -1.245920 -0.327196 -0.298967
D -0.945278  0.092055  0.091722
E  1.362240 -1.738529 -0.055404

In [6]:
df['X']

A    0.832021
B    0.231534
C   -1.245920
D   -0.945278
E    1.362240
Name: X, dtype: float64

In [7]:
df[['X','Y']]

          X         Y
A  0.832021  0.108961
B  0.231534 -1.417395
C -1.245920 -0.327196
D -0.945278  0.092055
E  1.362240 -1.738529

In [8]:
df['new']= df['X']+df['Y']

In [9]:
df

          X         Y         Z       new
A  0.832021  0.108961 -0.007013  0.940982
B  0.231534 -1.417395  0.149589 -1.185861
C -1.245920 -0.327196 -0.298967 -1.573116
D -0.945278  0.092055  0.091722 -0.853223
E  1.362240 -1.738529 -0.055404 -0.376289

In [11]:
#for row axis is 0
df.drop('new',axis=1)

          X         Y         Z
A  0.832021  0.108961 -0.007013
B  0.231534 -1.417395  0.149589
C -1.245920 -0.327196 -0.298967
D -0.945278  0.092055  0.091722
E  1.362240 -1.738529 -0.055404

In [12]:
# Not inplace unless specified!
df.drop('new',axis=1,inplace=True)

In [14]:
df.loc['A']

X    0.832021
Y    0.108961
Z   -0.007013
Name: A, dtype: float64

In [16]:
df.iloc[2]

X   -1.245920
Y   -0.327196
Z   -0.298967
Name: C, dtype: float64

In [17]:
df.loc['A','Y']

0.1089612454847555

In [18]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.832021  0.108961
B  0.231534 -1.417395

In [19]:
df[df>0]

          X         Y         Z
A  0.832021  0.108961       NaN
B  0.231534       NaN  0.149589
C       NaN       NaN       NaN
D       NaN  0.092055  0.091722
E  1.362240       NaN       NaN

In [24]:
df[df['X']>0]['Y']

A    0.108961
B   -1.417395
E   -1.738529
Name: Y, dtype: float64

In [27]:
df[(df['X'] > 0) & (df['Y']>0)]

          X         Y         Z
A  0.832021  0.108961 -0.007013

In [28]:
df[(df['X'] > 0) | (df['Y']>0)]

          X         Y         Z
A  0.832021  0.108961 -0.007013
B  0.231534 -1.417395  0.149589
D -0.945278  0.092055  0.091722
E  1.362240 -1.738529 -0.055404

In [29]:
# Reset to default 0,1...n index
df.reset_index()

  index         X         Y         Z
0     A  0.832021  0.108961 -0.007013
1     B  0.231534 -1.417395  0.149589
2     C -1.245920 -0.327196 -0.298967
3     D -0.945278  0.092055  0.091722
4     E  1.362240 -1.738529 -0.055404

In [33]:
newin = 'NYC WAS IND CIN PAK'.split()

In [34]:
df['States']=newin

In [38]:
df.set_index('States')

               X         Y         Z
States
NYC     0.832021  0.108961 -0.007013
WAS     0.231534 -1.417395  0.149589
IND    -1.245920 -0.327196 -0.298967
CIN    -0.945278  0.092055  0.091722
PAK     1.362240 -1.738529 -0.055404

In [39]:
df.set_index('States',inplace=True)

In [40]:
df

               X         Y         Z
States
NYC     0.832021  0.108961 -0.007013
WAS     0.231534 -1.417395  0.149589
IND    -1.245920 -0.327196 -0.298967
CIN    -0.945278  0.092055  0.091722
PAK     1.362240 -1.738529 -0.055404

In [41]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [42]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [45]:
df = pd.DataFrame(randn(6,2),index=hier_index,columns=['A','B'])

In [46]:
df

             A         B
G1 1 -1.246397  0.704007
   2 -1.754449 -1.014011
   3  0.914930 -0.485420
G2 1  0.639932  1.483486
   2 -0.560996  0.988492
   3 -0.455640  0.923365

In [47]:
df.loc['G1']

          A         B
1 -1.246397  0.704007
2 -1.754449 -1.014011
3  0.914930 -0.485420

In [49]:
df.loc['G1'].loc[1]

A   -1.246397
B    0.704007
Name: 1, dtype: float64

In [50]:
df.index.names

FrozenList([None, None])

In [51]:
df.index.names=['Group','Name']

In [52]:
df

                   A         B
Group Name
G1    1    -1.246397  0.704007
      2    -1.754449 -1.014011
      3     0.914930 -0.485420
G2    1     0.639932  1.483486
      2    -0.560996  0.988492
      3    -0.455640  0.923365

In [53]:
df.xs(['G1',1])

A   -1.246397
B    0.704007
Name: (G1, 1), dtype: float64

In [55]:
df.xs(1,level='Name')

              A         B
Group
G1    -1.246397  0.704007
G2     0.639932  1.483486